projects/04_naca_airfoil_analysis/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}

boundary
{
    inlet
    {
        type patch;
    }

    outlet
    {
        type patch;
    }

    top
    {
        type symmetryPlane;
    }

    bottom
    {
        type symmetryPlane;
    }

    airfoil
    {
        type wall;
    }

    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
